{
  "name": "PRIYANSHU",
  "contact": {
    "phone": "+91 9058765136",
    "linkedin": "priyanshu-linkedin",
    "email": "priyanshu1kumar24@gmail.com"
  },
  "professional_experience": [
    {
      "company": "Capgemini Technology Services India Limited",
      "location": "Bengaluru",
      "title": "Senior Analyst",
      "dates": "July 2022 - Present",
      "responsibilities": [
        "Spearheaded the design and implementation of user interface components for TypeScript-based mobile applications using React Native, resulting in a 30% improvement in app responsiveness.",
        "Expertly designed Jest unit tests, consistently achieving over 90% coverage. My commitment to robust testing practices resulted in reliable and high-quality code, contributing to the overall stability of our applications.",
        "Led the implementation of clean and modern animations & transitions, employing cutting-edge tools like GitHub, Firestore, Google Maps, and more. This strategic approach significantly optimized the development workflow, fostering seamless collaboration within the team and reducing development time by 20%.",
        "Effectively employed Redux-Saga and Redux Toolkit architecture, resulting in a notable improvement of 25% in mobile app performance. This implementation successfully enhanced functionality and responsiveness, leading to an improved user experience.",
        "Continuously collaborated with backend teams to meet functional and performance requirements, leading to the successful completion of work within 80-90% of the allotted timeline."
      ]
    },
    {
      "company": "Capgemini Technology",
      "location": "Bengaluru",
      "title": "Software Engineering Intern",
      "dates": "Mar 2022 - May 2022",
      "responsibilities": [
        "Developed and maintained UI screens with React Native, focusing on creating a smooth and user-friendly interface.",
        "Successfully orchestrated the integration of Node.js APIs into React Native applications, guaranteeing seamless functionality and elevating the user experience."
      ]
    },
    {
      "company": "ConcurIP Technologies",
      "location": "Bengaluru",
      "title": "Software Engineering Intern",
      "dates": "Oct 2021 - Mar 2022",
      "responsibilities": [
        "Engaged closely with clients to understand project requirements, gather feedback, and provide technical insights.",
        "Performed in-depth code analysis."
      ]
    }
  ],
  "skills": {
    "programming_languages": ["JavaScript", "TypeScript", "C++"],
    "frameworks": ["React", "React Native", "Node.js"],
    "databases": ["MongoDB", "Firestore"],
    "tools": ["VS Code", "Jira", "Postman", "Android Studio"],
    "testing_tools": ["Jest"],
    "version_control": ["Git"],
    "others": ["Linux"]
  },
  "key_projects": [
    {
      "name": "Zig Cabio",
      "technologies": ["React Native", "TypeScript", "Axios", "Google Map API", "NodeJS API"],
      "description": [
        "Spearheaded the development and enhancement of features in Zig Cabio's React Native app as a Freelancer, resulting in a 30% increase in overall app functionality.",
        "Integrated real-time tracking and fortified payment gateways to guarantee an uninterrupted and secure user experience.",
        "Created a dedicated student-focused module to enhance safety and reliability in transportation services.",
        "Led open and transparent communication with the Zig Cabio team, fostering collaboration and achieving a 20% increase in project alignment.",
        "Championed comprehensive efforts in requirement gathering, project estimation, planning, and execution, resulting in a 15% improvement in project efficiency.",
        "Designed and streamlined multiple screens, optimizing the user interface and implementing modular components, resulting in a 20% reduction in code lines and improved code maintainability."
      ]
    },
    {
      "name": "Alstom DBB Project",
      "technologies": ["React Native", "JavaScript", "Jest Unit Testing", "SalesforceAPI"],
      "description": [
        "Focused on creating components aligned with the principles of clean code for a maintainable and scalable codebase.",
        "Created custom components such as buttons, modals, etc., to cater to specific app requirements.",
        "Dedicated to achieving comprehensive 90% unit test coverage for the components, contributing to the overall robustness of the solution."
      ]
    },
    {
      "name": "Mobile App with Arduino",
      "technologies": ["React Native", "TypeScript", "Arduino"],
      "description": [
        "Leading the development of a mobile application with a primary focus on establishing seamless communication with Arduino devices.",
        "Initiating communication with Arduino devices to establish connectivity.",
        "Enabling BLE (Bluetooth Low Energy) communication for efficient data transfer."
      ]
    }
  ],
  "education": {
    "institution": "ABES Engineering College",
    "location": "Ghaziabad",
    "degree": "Bachelor of Technology - Computer Science",
    "percentage": "74.4%",
    "dates": "Jul 2019 - Jun 2022"
  }
}